02-diagramme-classes/apport-de-connaissance/apport-de-connaissance.md
```mermaid
classDiagram
    class Forme {
        <<abstract>>
        +calculerSurface() float
        +calculerPerimetre() float
    }
    class Cercle {
        -float rayon
        +calculerSurface() float
        +calculerPerimetre() float
    }
    class Rectangle {
        -float largeur
        -float hauteur
        +calculerSurface() float
        +calculerPerimetre() float
    }
    Forme <|-- Cercle
    Forme <|-- Rectangle
```
